music_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def self.find_by_credentials(email, password)
    user = User.find_by(email: email)