music_app/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Crazy Cats "], ["user_id", 6], ["created_at", "2018-11-16 01:00:02.701197"], ["updated_at", "2018-11-16 01:00:02.701197"]]
---
  def create
    @band = Band.new(band_params)
    # debugger
    @band.user_id = current_user.id
    if @band.save